================================================================================
basic comment
================================================================================
# this is a comment
--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
data section
================================================================================
__DATA__
$this = not `code`
--------------------------------------------------------------------------------
(source_file (data_section))
================================================================================
data section anywhere
================================================================================
1 + 2 __DATA__
$this = not `code`
--------------------------------------------------------------------------------
(source_file
  (expression_statement (binary_expression (number) (number)))
  (data_section)
)

================================================================================
maths! higher prec
================================================================================
2 * 4 ** 5;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (number)
      right: (binary_expression
        left: (number)
        right: (number)))))

================================================================================
maths: same prec - left assoc
================================================================================
3 x 5 % 2;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (binary_expression
        left: (number)
        right: (number))
      right: (number))))

================================================================================
unary prefixes!
================================================================================
!3;
~0;
~.0;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (unary_expression
      (number)))
  (expression_statement
    (unary_expression
      (number)))
  (expression_statement
    (unary_expression
      (number))))
